Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_pgl.h
/**
  * @brief    LUT中断使能
  * @rmtoll   IER    LUTIE    FL_PGL_EnableIT_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_EnableIT_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    SET_BIT(PGLx->IER, ((LUTx & 0xf) << 0x0U));
}

/**
  * @brief    读取LUT中断使能状态
  * @rmtoll   IER    LUTIE    FL_PGL_IsEnabledIT_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_PGL_IsEnabledIT_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    return (uint32_t)(READ_BIT(PGLx->IER, ((LUTx & 0xf) << 0x0U)) == ((LUTx & 0xf) << 0x0U));
}

/**
  * @brief    失能LUT中断
  * @rmtoll   IER    LUTIE    FL_PGL_DisableIT_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_DisableIT_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    CLEAR_BIT(PGLx->IER, ((LUTx & 0xf) << 0x0U));
}

/**
  * @brief    获取LUT中断标志
  * @rmtoll   ISR    LUTIF    FL_PGL_IsActiveFlag_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE uint32_t FL_PGL_IsActiveFlag_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    return (uint32_t)(READ_BIT(PGLx->ISR, ((LUTx & 0xf) << 0x0U)) == ((LUTx & 0xf) << 0x0U));
}

/**
  * @brief    清除LUT中断标志
  * @rmtoll   ISR    LUTIF    FL_PGL_ClearFlag_LUT
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_ClearFlag_LUT(PGL_Type *PGLx, uint32_t LUTx)
{
    WRITE_REG(PGLx->ISR, ((LUTx & 0xf) << 0x0U));
}

/**
  * @brief    设置LUT0真值表
  * @rmtoll   LUT        FL_PGL_WriteLUTTruthTable
  * @param    PGLx PGL instance
  * @param    LUTx This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @param    truth 
  * @retval   None
  */
__STATIC_INLINE void FL_PGL_WriteLUTTruthTable(PGL_Type *PGLx, uint32_t LUTx, uint32_t truth)
{
   switch(LUTx)
    {
        case FL_PGL_LUT0:
            MODIFY_REG(PGLx->LUT0, (0xffffU << 0U), (truth << 0U));
            break;
        case FL_PGL_LUT1:
            MODIFY_REG(PGLx->LUT1, (0xffffU << 0U), (truth << 0U));
            break;
        case FL_PGL_LUT2:
            MODIFY_REG(PGLx->LUT2, (0xffffU << 0U), (truth << 0U));
            break;
        case FL_PGL_LUT3:
            MODIFY_REG(PGLx->LUT3, (0xffffU << 0U), (truth << 0U));
            break;
        default:
            MODIFY_REG(PGLx->LUT0, (0xffffU << 0U), (0x0U << 0U));
            break;
    }
}

/**
  * @brief    读取LUT0真值表
  * @rmtoll   LUT        FL_PGL_ReadLUTTruthTable
  * @param    PGLx PGL instance
  * @param    truth This parameter can be one of the following values:
  *           @arg @ref FL_PGL_LUT0
  *           @arg @ref FL_PGL_LUT1
  *           @arg @ref FL_PGL_LUT2
  *           @arg @ref FL_PGL_LUT3
  * @retval   
  */
__STATIC_INLINE uint32_t FL_PGL_ReadLUTTruthTable(PGL_Type *PGLx, uint32_t LUTx)
{
    uint32_t truth = 0;
    switch(LUTx)
    {
        case FL_PGL_LUT0:
            truth = (uint32_t)(READ_BIT((PGLx->LUT0), 0xffffU) >> 0U);
            break;
        case FL_PGL_LUT1:
            truth = (uint32_t)(READ_BIT((PGLx->LUT1), 0xffffU) >> 0U);
            break;
        case FL_PGL_LUT2:
            truth = (uint32_t)(READ_BIT((PGLx->LUT2), 0xffffU) >> 0U);
            break;
        case FL_PGL_LUT3:
            truth = (uint32_t)(READ_BIT((PGLx->LUT3), 0xffffU) >> 0U);
            break;
        default:
            truth = 0;
            break;
    }
    return truth;
}

/**
  * @}
  */

/** @defgroup PGL_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_PGL_DeInit(PGL_Type *PGLx);
FL_ErrorStatus FL_PGL_LUT_Init(PGL_Type *PGLx, uint32_t LUTx, FL_PGL_LUT_InitTypeDef *lutInit);
void FL_PGL_StructInit(FL_PGL_LUT_InitTypeDef *PGL_InitStruct);
/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LD5XX_FL_PGL_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.1 @ 2025-02-20*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
